# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя –
# школьница. Петя помогает Кате по математике. Он задумывает два
# натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
# этого Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа.
sum = int(input("Input the sum of the numbers: "))
mult = int(input("Input the result of multiplication of numbers: "))
for i in range(1, sum):
    if mult == i*(sum-i):
        print(i, sum-i)